# St7EnableHRALoadCase

Enables the specified load case such that it is included when the load type is set to Applied Load.

long St7EnableHRALoadCase(long uID, long CaseNum)

Input Parameters

uID

Strand7 model file ID.

Strand7 API Manual

CaseNum

Load case number.